[Killed] BlockStatement
punycache.js:6:33
 module.exports = function factory (options = {}) {
   const infinity = Number.POSITIVE_INFINITY
 
-  const getNumber = (member) => {
-    const value = options[member]
-    if (value === undefined) {
-      return infinity
-    }
-    if (!Number.isInteger(value) || value <= 0) {
-      throw new Error(`Invalid ${member}`)
-    }
-    return value
-  }
+  const getNumber = (member) => {}
 
   const ttl = getNumber('ttl')
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ConditionalExpression
punycache.js:8:9
 
   const getNumber = (member) => {
     const value = options[member]
-    if (value === undefined) {
+    if (false) {
       return infinity
     }
killedBy: punycache happy path stores a value
statusReason: Error: Invalid ttl

[Killed] BlockStatement
punycache.js:8:30
 
   const getNumber = (member) => {
     const value = options[member]
-    if (value === undefined) {
-      return infinity
-    }
+    if (value === undefined) {}
     if (!Number.isInteger(value) || value <= 0) {
       throw new Error(`Invalid ${member}`)
killedBy: punycache happy path stores a value
statusReason: Error: Invalid ttl

[Killed] EqualityOperator
punycache.js:11:37
     if (value === undefined) {
       return infinity
     }
-    if (!Number.isInteger(value) || value <= 0) {
+    if (!Number.isInteger(value) || value > 0) {
       throw new Error(`Invalid ${member}`)
     }
killedBy: punycache options validation ttl accepts only numbers (0)
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Invalid ttl"

Received function did not throw

[Killed] ConditionalExpression
punycache.js:11:9
     if (value === undefined) {
       return infinity
     }
-    if (!Number.isInteger(value) || value <= 0) {
+    if (true) {
       throw new Error(`Invalid ${member}`)
     }
killedBy: punycache ttl keeps a value until ttl is reached
statusReason: Error: Invalid ttl

[Killed] StringLiteral
punycache.js:17:25
     return value
   }
 
-  const ttl = getNumber('ttl')
+  const ttl = getNumber("")
   const max = getNumber('max')
   const policy = options.policy || 'lru'
killedBy: punycache options validation ttl accepts only numbers ("1")
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Invalid ttl"

Received function did not throw

[Killed] StringLiteral
punycache.js:18:25
   }
 
   const ttl = getNumber('ttl')
-  const max = getNumber('max')
+  const max = getNumber("")
   const policy = options.policy || 'lru'
 
killedBy: punycache options validation max accepts only numbers ("1")
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Invalid max"

Received function did not throw

[Killed] ConditionalExpression
punycache.js:19:18
 
   const ttl = getNumber('ttl')
   const max = getNumber('max')
-  const policy = options.policy || 'lru'
+  const policy = true
 
   const cache = Object.create(null)
killedBy: punycache happy path stores a value
statusReason: Error: Invalid policy

[Killed] ConditionalExpression
punycache.js:19:18
 
   const ttl = getNumber('ttl')
   const max = getNumber('max')
-  const policy = options.policy || 'lru'
+  const policy = false
 
   const cache = Object.create(null)
killedBy: punycache happy path stores a value
statusReason: Error: Invalid policy

[Killed] ArrowFunction
punycache.js:23:15
 
   const cache = Object.create(null)
 
-  const now = () => Date.now()
+  const now = () => undefined
   const keys = () => Object.keys(cache)
 
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ArrowFunction
punycache.js:24:16
   const cache = Object.create(null)
 
   const now = () => Date.now()
-  const keys = () => Object.keys(cache)
+  const keys = () => undefined
 
   const deleteLowestBasedOnMember = member => () => {
killedBy: punycache happy path stores a value
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
punycache.js:26:37
   const now = () => Date.now()
   const keys = () => Object.keys(cache)
 
-  const deleteLowestBasedOnMember = member => () => {
-    let last = infinity
-    let lastKey
-    for (const key in cache) {
-      const { [member]: current } = cache[key]
-      // Stryker disable EqualityOperator
-      if (current < last) { // or <= does not change the logic
-        last = current
-        lastKey = key
-      }
-    }
-    delete cache[lastKey]
-  }
+  const deleteLowestBasedOnMember = () => undefined
 
   const policies = {
killedBy: punycache happy path stores a value
statusReason: Error: Invalid policy

[Killed] BlockStatement
punycache.js:26:53
   const now = () => Date.now()
   const keys = () => Object.keys(cache)
 
-  const deleteLowestBasedOnMember = member => () => {
-    let last = infinity
-    let lastKey
-    for (const key in cache) {
-      const { [member]: current } = cache[key]
-      // Stryker disable EqualityOperator
-      if (current < last) { // or <= does not change the logic
-        last = current
-        lastKey = key
-      }
-    }
-    delete cache[lastKey]
-  }
+  const deleteLowestBasedOnMember = member => () => {}
 
   const policies = {
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:29:30
   const deleteLowestBasedOnMember = member => () => {
     let last = infinity
     let lastKey
-    for (const key in cache) {
-      const { [member]: current } = cache[key]
-      // Stryker disable EqualityOperator
-      if (current < last) { // or <= does not change the logic
-        last = current
-        lastKey = key
-      }
-    }
+    for (const key in cache) {}
     delete cache[lastKey]
   }
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] ConditionalExpression
punycache.js:32:11
     for (const key in cache) {
       const { [member]: current } = cache[key]
       // Stryker disable EqualityOperator
-      if (current < last) { // or <= does not change the logic
+      if (true) { // or <= does not change the logic
         last = current
         lastKey = key
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] ConditionalExpression
punycache.js:32:11
     for (const key in cache) {
       const { [member]: current } = cache[key]
       // Stryker disable EqualityOperator
-      if (current < last) { // or <= does not change the logic
+      if (false) { // or <= does not change the logic
         last = current
         lastKey = key
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:46:29
   }
 
   const remove = policies[policy]
-  if (remove === undefined) {
-    throw new Error('Invalid policy')
-  }
+  if (remove === undefined) {}
 
   const prune = () => {
killedBy: punycache options validation policy accepts only known values
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Invalid policy"

Received function did not throw

[Killed] ConditionalExpression
punycache.js:46:7
   }
 
   const remove = policies[policy]
-  if (remove === undefined) {
+  if (false) {
     throw new Error('Invalid policy')
   }
killedBy: punycache options validation policy accepts only known values
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Invalid policy"

Received function did not throw

[Killed] BlockStatement
punycache.js:50:23
     throw new Error('Invalid policy')
   }
 
-  const prune = () => {
-    const nowInMs = now()
-    let changed = false
-    for (const key in cache) {
-      const { e } = cache[key]
-      if (e <= nowInMs) {
-        delete cache[key]
-        changed = true
-      }
-    }
-    return changed
-  }
+  const prune = () => {}
 
   const access = key => {
killedBy: punycache ttl removes a value when ttl is reached (keys)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "a",

[Killed] BooleanLiteral
punycache.js:52:19
 
   const prune = () => {
     const nowInMs = now()
-    let changed = false
+    let changed = true
     for (const key in cache) {
       const { e } = cache[key]
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:53:30
   const prune = () => {
     const nowInMs = now()
     let changed = false
-    for (const key in cache) {
-      const { e } = cache[key]
-      if (e <= nowInMs) {
-        delete cache[key]
-        changed = true
-      }
-    }
+    for (const key in cache) {}
     return changed
   }
killedBy: punycache ttl removes a value when ttl is reached (keys)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "a",

[Killed] BlockStatement
punycache.js:55:25
     let changed = false
     for (const key in cache) {
       const { e } = cache[key]
-      if (e <= nowInMs) {
-        delete cache[key]
-        changed = true
-      }
+      if (e <= nowInMs) {}
     }
     return changed
killedBy: punycache ttl removes a value when ttl is reached (keys)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "a",

[Killed] ConditionalExpression
punycache.js:55:11
     let changed = false
     for (const key in cache) {
       const { e } = cache[key]
-      if (e <= nowInMs) {
+      if (false) {
         delete cache[key]
         changed = true
killedBy: punycache ttl removes a value when ttl is reached (keys)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "a",

[Killed] BooleanLiteral
punycache.js:57:19
       const { e } = cache[key]
       if (e <= nowInMs) {
         delete cache[key]
-        changed = true
+        changed = false
       }
     }
killedBy: punycache combining ttl & max applies ttl before looking for lru
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "b",
    "c",

[Killed] BlockStatement
punycache.js:63:25
     return changed
   }
 
-  const access = key => {
-    const cached = cache[key]
-    const nowInMs = now()
-    if (cached && cached.e > nowInMs) {
-      cached.t = nowInMs
-      return cached
-    }
-  }
+  const access = key => {}
 
   return {
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ConditionalExpression
punycache.js:66:9
   const access = key => {
     const cached = cache[key]
     const nowInMs = now()
-    if (cached && cached.e > nowInMs) {
+    if (true) {
       cached.t = nowInMs
       return cached
killedBy: punycache happy path stores a value
statusReason: TypeError: Cannot set properties of undefined (setting 't')

[Killed] LogicalOperator
punycache.js:66:9
   const access = key => {
     const cached = cache[key]
     const nowInMs = now()
-    if (cached && cached.e > nowInMs) {
+    if (cached || cached.e > nowInMs) {
       cached.t = nowInMs
       return cached
killedBy: punycache happy path stores a value
statusReason: TypeError: Cannot read properties of undefined (reading 'e')

[Killed] BlockStatement
punycache.js:73:18
   }
 
   return {
-    set (key, v) {
-      const nowInMs = now()
-      let cached = access(key)
-      if (!cached) {
-        keys().length === max && !prune() && remove()
-        cached = {
-          f: 0
-        }
-        cache[key] = cached
-      }
-      Object.assign(cached, {
-        e: nowInMs + ttl,
-        t: nowInMs,
-        f: cached.f + 1,
-        v
-      })
-    },
+    set (key, v) {},
 
     get (key) {
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] BooleanLiteral
punycache.js:76:11
     set (key, v) {
       const nowInMs = now()
       let cached = access(key)
-      if (!cached) {
+      if (cached) {
         keys().length === max && !prune() && remove()
         cached = {
killedBy: punycache happy path stores a value
statusReason: TypeError: Cannot read properties of undefined (reading 'f')

[Killed] ConditionalExpression
punycache.js:76:11
     set (key, v) {
       const nowInMs = now()
       let cached = access(key)
-      if (!cached) {
+      if (false) {
         keys().length === max && !prune() && remove()
         cached = {
killedBy: punycache happy path stores a value
statusReason: TypeError: Cannot read properties of undefined (reading 'f')

[Killed] LogicalOperator
punycache.js:77:9
       const nowInMs = now()
       let cached = access(key)
       if (!cached) {
-        keys().length === max && !prune() && remove()
+        keys().length === max || !prune() && remove()
         cached = {
           f: 0
killedBy: punycache happy path lists values
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "a",
    "b",

[Killed] ConditionalExpression
punycache.js:77:9
       const nowInMs = now()
       let cached = access(key)
       if (!cached) {
-        keys().length === max && !prune() && remove()
+        true
         cached = {
           f: 0
killedBy: punycache max lru (default) removes the oldest key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] ObjectLiteral
punycache.js:83:29
         }
         cache[key] = cached
       }
-      Object.assign(cached, {
-        e: nowInMs + ttl,
-        t: nowInMs,
-        f: cached.f + 1,
-        v
-      })
+      Object.assign(cached, {})
     },
 
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ArithmeticOperator
punycache.js:84:12
         cache[key] = cached
       }
       Object.assign(cached, {
-        e: nowInMs + ttl,
+        e: nowInMs - ttl,
         t: nowInMs,
         f: cached.f + 1,
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ArithmeticOperator
punycache.js:86:12
       Object.assign(cached, {
         e: nowInMs + ttl,
         t: nowInMs,
-        f: cached.f + 1,
+        f: cached.f - 1,
         v
       })
killedBy: punycache max lfu removes the least frequently used key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:91:15
       })
     },
 
-    get (key) {
-      const cached = access(key)
-      if (cached) {
-        ++cached.f
-        return cached.v
-      }
-    },
+    get (key) {},
 
     del (key) {
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ConditionalExpression
punycache.js:93:11
 
     get (key) {
       const cached = access(key)
-      if (cached) {
+      if (false) {
         ++cached.f
         return cached.v
killedBy: punycache happy path stores a value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "a"
Received: undefined

[Killed] ConditionalExpression
punycache.js:93:11
 
     get (key) {
       const cached = access(key)
-      if (cached) {
+      if (true) {
         ++cached.f
         return cached.v
killedBy: punycache happy path removes a value
statusReason: TypeError: Cannot read properties of undefined (reading 'f')

[Killed] UpdateOperator
punycache.js:94:9
     get (key) {
       const cached = access(key)
       if (cached) {
-        ++cached.f
+        --cached.f
         return cached.v
       }
killedBy: punycache max lfu removes the least frequently used key when when inserting more values
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:99:15
       }
     },
 
-    del (key) {
-      delete cache[key]
-    },
+    del (key) {},
 
     keys () {
killedBy: punycache happy path removes a value
statusReason: Error: expect(received).toBeUndefined()

Received: 1

[Killed] BlockStatement
punycache.js:103:13
       delete cache[key]
     },
 
-    keys () {
-      prune()
-      return keys()
-    }
+    keys () {}
   }
 }
killedBy: punycache happy path lists values
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')
